Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh340-v2.tmx
Source language: bo
Languages: en

source: དེའི་ཚེ་གང་གིས་དཔུང་གི་ཚོགས་ཡན་ལག་བཞི་དང་ཡུལ་བསྲུངས་པ་དེ་ནི་དགེ་སློང་འོད་སྲུང་འདི་ཁོ་ན་ཡིན་ནོ། །
en: The one who safeguarded the four divisions of the army and the country then is none other than the monk Kāśyapa .

source: དེའི་ཚེ་གང་གིས་རྒྱལ་པོའི་བུ་དང་རྒྱལ་པོའི་དཀོར་མཛོད་བསྲུངས་པ་དེ་ནི་ཀུན་དགའ་བོ་འདི་ཁོ་ན་ཡིན་ནོ། །
en: The one who safeguarded the prince and the royal treasury then is none other than Ānanda.

source: དེའི་ཚེ་རྒྱལ་པོའི་བུར་གྱུར་པ་གང་ཡིན་པ་དེ་ནི་གསོ་མ་ཅན་ཡིན་ཏེ།
en: The one who was the prince then is none other than Śāṇavāsa.

source: དེའི་ཚེ་ཡང་ངས་རྒས་ཀར་གཅིག་ལ་ནི་རྒྱལ་པོའི་བུ་དང་དཀོར་མཛོད་གཏད་དོ། །
en: At that time, I handed the prince and my royal treasury to one younger than myself,

source: གཅིག་ལ་ནི་དཔུང་གི་ཚོགས་ཡན་ལག་བཞི་དང་ཡུལ་གཏད་དོ། །
en: and to another younger than myself I likewise handed my country and the four divisions of my army.

source: དེ་གཉིས་ཀྱིས་ཀྱང་ང་ཤི་སྟེ། དུས་ལས་འདས་པའི་འོག་ཏུ། རྒྱལ་པོའི་ཕོ་བྲང་བསྲུངས་ཏེ་རྒྱས་པར་བྱས་སོ། །
en: “At that time, after I died and passed on, they likewise cared for the royal palace and made it prosperous.

source: ད་ལྟར་ཡང་ངས་དུས་ཀྱི་ཐ་མ་ལ་ཐུག་པ་ན་གཅིག་ལ་ནི་ཐོས་པའི་མཛོད་གཏད་དོ། །
en: Now, as I am once again nearing the end, I have handed to one the treasury of teachings,

source: གཅིག་ལ་ནི་བསྟན་པ་གཏད་དེ།
en: and to the other I have handed the doctrine;

source: འདི་གཉིས་ཀྱིས་ང་ཡོངས་སུ་མྱ་ངན་ལས་འདས་པའི་འོག་ཏུ་བསྟན་པ་རྒྱས་པར་བྱེད་དོ། །
en: after my parinirvāṇa, they will make the doctrine known.

source: གཞན་ཡང་དགེ་སློང་ཀུན་དགའ་བོ་དང་འོད་སྲུང་གིས་སྨོན་ལམ་བཏབ་སྟེ།
en: “Furthermore, regarding the monks Ānanda and Kāśyapa , one prayed,

source: གཅིག་གིས་ནི་བདག་དེའི་ཐོས་པ་རྣམས་ཀྱི་མཆོག་ཏུ་གྱུར་ཅིག །
en: ‘May I become supreme among the learned.

source: དེ་ཡོངས་སུ་མྱ་ངན་ལས་འདས་པའི་འོག་ཏུ་ཡང་ཐོས་པའི་མཛོད་རྒྱས་པར་བྱེད་པར་གྱུར་ཅིག་ཅེས་བྱས་སོ། །
en: After the Blessed One’s parinirvāṇa, may I make known the treasury of teachings,’

source: གཅིག་གིས་ཀྱང་ཀྱེ་མ། ཤཱཀྱ་ཐུབ་པ་ཤཱཀྱའི་རྒྱལ་པོའི་མཆོག་དེ་ཡོངས་སུ་མྱ་ངན་ལས་འདས་པའི་འོག་ཏུ་བདག་གིས་དེའི་བསྟན་པའི་དོན་བྱེད་པར་ཤོག་ཅེས་བྱས་སོ། །
en: while the other prayed, ‘After the Śākya sage, foremost King of the Śākyas, passes into parinirvāṇa, may I fulfill the aim of his doctrine.’ ”

source: གསོལ་པ། བཙུན་པ་འདི་གཉིས་ཀྱིས་གང་དུ་སྨོན་ལམ་བཏབ་ལགས།
en: “Lord, where did they make these prayers?” the monks inquired.

source: དེའི་གསུང་རབ་ལ་དགེ་སློང་ཀུན་དགའ་བོ་རབ་ཏུ་བྱུང་ནས། དེ་སུ་ལས་རབ་ཏུ་བྱུང་བ་དེ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འོད་སྲུང་གིས་ཐོས་པ་འཛིན་པ་རྣམས་ཀྱི་མཆོག་ཏུ་བསྟན་ཏོ། །
en: the monk Ānanda went forth in his teaching, and the totally and completely awakened Buddha Kāśyapa commended the one who had led Ānanda to go forth as foremost among keepers of the teachings.

source: དེས་དེར་ཚེ་གཅིག་ཏུ་ཚངས་པར་སྤྱོད་པ་སྤྱད་ནས་
en: “At that time he practiced pure conduct all his life,

source: ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འོད་སྲུང་གིས་བྲམ་ཟེའི་ཁྱེའུ་བླ་མ་ལུང་བསྟན་པ་གང་ཡིན་པའི། སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་བདག་གིས་མཉེས་པར་བྱེད་པར་གྱུར་ཅིག །མི་མཉེས་པར་བྱེད་པར་མ་གྱུར་ཅིག །
en: ‘May I please and not displease Uttara, the young brahmin prophesied by the totally and completely awakened Buddha Kāśyapa to be the next blessed buddha.

source: ཇི་ལྟར་བདག་གི་མཁན་པོ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འོད་སྲུང་གིས་ཐོས་པ་འཛིན་པ་རྣམས་ཀྱི་མཆོག་ཏུ་བསྟན་པ་དེ་བཞིན་དུ་བདག་ཀྱང་།
en: Just as the Buddha Kāśyapa commended my preceptor as foremost among keepers of the teachings, may the Śākya sage,

source: ཤཱཀྱ་ཐུབ་པ་ཤཱཀྱའི་རྒྱལ་པོའི་མཆོག་དེས་ཐོས་པ་འཛིན་པ་རྣམས་ཀྱི་མཆོག་ཏུ་བསྟན་པར་གྱུར་ཅིག །
en: the most excellent King of the Śākyas, likewise commend me as foremost among keepers of the teachings.

source: དེ་ཡོངས་སུ་མྱ་ངན་ལས་འདས་པའི་འོག་ཏུ་ཡང་བདག་གིས་ཐོས་པའི་མཛོད་རྒྱས་པར་བྱེད་པར་གྱུར་ཅིག་ཅེས་བྱས་སོ། །
en: After his parinirvāṇa may I make known the treasury of his teachings.’

source: དེའི་ཚེ་དགེ་སློང་དུ་གྱུར་པ་གང་ཡིན་པ་དེ་ནི་ཀུན་དགའ་བོ་འདི་ཁོ་ན་ཡིན་ཏེ།
en: The one who was that monk then is none other than Ānanda himself.

source: དེས་དེར་སྨོན་ལམ་བཏབ་པ་དེས་ན།
en: At that time he prayed thus,

source: འདིས་ང་མཉེས་པར་བྱས་ཏེ་མི་མཉེས་པར་མ་བྱས་ལ། ང་ཉིད་ཀྱི་བསྟན་པ་ལ་རབ་ཏུ་བྱུང་ནས་ཉོན་མོངས་པ་ཐམས་ཅད་སྤངས་ཏེ་དགྲ་བཅོམ་པ་ཉིད་མངོན་སུམ་དུ་བྱེད་པར་འགྱུར་ལ།
en: that he has pleased me, not displeased me, gone forth in my very doctrine, cast away all afflictive emotions, and manifested arhatship;

source: འདི་ཡང་ངས་ཐོས་པ་འཛིན་པ་རྣམས་ཀྱི་མཆོག་ཏུ་བསྟན་ཏེ
en: that I have commended him as foremost among keepers of the teachings;

source: ང་ཡོངས་སུ་མྱ་ངན་ལས་འདས་པའི་འོག་ཏུ་ཡང་ཐོས་པ་རྒྱས་པར་བྱེད་པར་འགྱུར་རོ། །
en: and that after my parinirvāṇa, he will make the teachings known.

source: དགེ་སློང་དག་དགེ་སློང་འོད་སྲུང་ཡང་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འོད་སྲུང་དེ་ཉིད་ཀྱི་གསུང་རབ་ལ་རབ་ཏུ་བྱུང་ནས།
en: “Monks, the monk Kāśyapa also went forth in the doctrine of the totally and completely awakened Buddha Kāśyapa,

source: དེ་གང་ལས་རབ་ཏུ་བྱུང་བ་དེ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འོད་སྲུང་གིས་སྦྱངས་པའི་ཡོན་ཏན་དང་ལྡན་པ་རྣམས་ཀྱི་མཆོག་ཏུ་བསྟན་ཏོ། །
en: and the totally and completely awakened Buddha Kāśyapa commended the one who had led him to go forth as foremost among those possessing the ascetic practices.

source: དེས་དེར་ཚེ་གཅིག་ཏུ་ཚངས་པར་སྤྱོད་པ་སྤྱད་ནས་འཆི་ཀར་སྨོན་ལམ་བཏབ་པ།
en: “At that time he practiced pure conduct all his life, and at the time of his death, he prayed,

source: འདི་ལྟར་བདག་གིས་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འོད་སྲུང་གི་བསྟན་པ་ལ་ཚེ་གཅིག་ཏུ་ཚངས་པར་སྤྱོད་པ་སྤྱད་ཀྱང་ཡོན་ཏན་གྱི་ཚོགས་ཅི་ཡང་མ་ཐོབ་ཀྱིས། ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འོད་སྲུང་གིས་བྲམ་ཟེའི་ཁྱེའུ་བླ་མ་ལུང་བསྟན་པ་གང་ཡིན་པའི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ། བདག་གིས་མཉེས་པར་བྱེད་པར་གྱུར་ཅིག །མི་མཉེས་པར་བྱེད་པར་མ་གྱུར་ཅིག །
en: ‘While I may not have attained any great virtues, still I have gone forth like this in the doctrine of the totally and completely awakened Buddha Kāśyapa and practiced pure conduct all my life. Therefore, may I please and not displease Uttara, the young brahmin prophesied by the totally and completely awakened Buddha Kāśyapa to be the next blessed buddha.

source: འདི་ལྟར་བདག་གི་མཁན་པོ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འོད་སྲུང་གིས། སྦྱངས་པའི་ཡོན་ཏན་དང་ལྡན་པ་རྣམས་ཀྱི་མཆོག་ཏུ་བསྟན་པ་དེ་བཞིན་དུ། བདག་ཀྱང་ཤཱཀྱ་ཐུབ་པ་ཤཱཀྱའི་རྒྱལ་པོའི་མཆོག་དེས། སྦྱངས་པའི་ཡོན་ཏན་དང་ལྡན་པ་རྣམས་ཀྱི་མཆོག་ཏུ་བསྟན་པར་གྱུར་ཅིག་ཅེས་བྱས་ནས།
en: Just as the totally and completely awakened Buddha Kāśyapa commended my preceptor as foremost among those possessing the ascetic practices, may the Śākya sage, the most excellent King of the Śākyas, likewise commend me as foremost among those possessing the ascetic practices.’

source: དེ་དེ་ནས་ཤི་འཕོས་ཏེ། དུས་ལས་འདས་ནས། གྲོང་ཁྱེར་བཱ་རཱ་ཎ་སཱི་དེ་ཉིད་དུ། བློན་པོའི་མཆོག་གི་ཁྱིམ་དུ་ཉིང་མཚམས་བླངས་ནས།
en: “When he died and transmigrated, he took rebirth in the city of Vārāṇasī in the family of a chief minister.

source: དེ་གང་གི་ཚེ་བཙས་ནས་ཆེར་སྐྱེས་པ་དེའི་ཚེ། རྒྱལ་པོ་ཀྲྀ་ཀཱིས་བློན་པོར་བཅུག་གོ། །
en: After his birth, when he had grown, King Kṛkī made him one of his ministers.

source: དེ་ནས་གང་གི་ཚེ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འོད་སྲུང་། སངས་རྒྱས་ཀྱི་ཕྲིན་ལས་ཐམས་ཅད་ཟིན་ནས། ལྷག་མ་མེད་པའི་མྱ་ངན་ལས་འདས་པའི་དབྱིངས་སུ་ཡོངས་སུ་མྱ་ངན་ལས་འདས་པའི་ཚེ། རྒྱལ་པོ་ཀྲྀ་ཀཱིས་དེའི་སྐུ་གདུང་ལ་མཆོད་པ་བྱས་ནས། རིན་པོ་ཆེའི་མཆོད་རྟེན་ཁོ་ར་ཁོར་ཡུག་ཏུ་དཔག་ཚད་གཅིག་ཡོད་པ་ཞིག་བྱེད་དུ་བཅུག་སྟེ།
en: When the totally and completely awakened Buddha Kāśyapa had carried out all the activities of a buddha and passed beyond all sorrow into the realm of nirvāṇa without any remainder, King Kṛkī venerated his relics and commissioned a jewel stūpa that was one league in circumference,

source: རྒྱལ་པོ་དེས་བློན་པོའི་བུ་དེ་མཆོད་རྟེན་དེའི་ལག་དཔོན་དུ་བསྐོས་སོ། །
en: for which the king appointed as overseer the minister’s son.

source: དེ་ནས་ཕྱི་ཞིག་ན་རྒྱལ་པོ་ཀྲྀ་ཀཱིས་མཆོད་རྟེན་དེ་རྣམ་པ་ཐམས་ཅད་ཡོངས་སུ་རྫོགས་པར་བྱས་ནས། དེར་མཆོད་རྟེན་གྱི་དུས་སྟོན་བྱ་བར་འདོད་དེ།
en: “One day, when King Kṛkī had completed every aspect of the stūpa, he wished to inaugurate the traditional festival of the stūpa,

source: དེས་བཟའ་བ་དང་བཅའ་བ་དང་གོས་མང་པོ་སྦྱར་ནས། དགེ་སློང་རྣམས་ལ་འབོད་དུ་བཅུག་གོ་གཡར་འདྲེན་བཏང་ངོ་། །
en: so he prepared a large quantity of food, drink, and robes, and extended an invitation to the monks.

source: དེར་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འོད་སྲུང་ཡོངས་སུ་མྱ་ངན་ལས་འདས་ནས་ཞག་བདུན་ལོན་ནས་བསྟན་པ་ནུབ་སྟེ།
en: When seven days had gone by since the totally and completely awakened Buddha Kāśyapa passed into parinirvāṇa, the doctrine disappeared.

source: དེ་ཡོངས་སུ་མྱ་ངན་ལས་འདས་ནས། དགེ་སློང་དབང་ཐོབ་པ་གང་ཡིན་པ་དེ་དག་ནི་ཡོངས་སུ་མྱ་ངན་ལས་འདས་སོ། །
en: After his parinirvāṇa, those monks who had achieved spiritual power also entered parinirvāṇa.

source: སོ་སོའི་སྐྱེ་བོ་གང་ཡིན་པ་དེ་དག་ནི་ཁྱིམ་པར་གྱུར་ཏོ། །
en: Those who were ordinary persons returned to home life.

source: དེ་ནས་དེར་གཡར་འདྲེན་པ་དེ་དག་གིས་དགེ་སློང་གཅིག་ཀྱང་མ་རྙེད་ནས།
en: As a result, those who had extended the invitations could not find a single monk.

source: རྒྱལ་པོ་ཀྲྀ་ཀཱིས་དགེ་སློང་དེ་དག་གར་དོང་ཞེས་སྨྲས་པ་དང་།
en: “ ‘Where have all the monks gone?’ asked King Kṛkī.

source: བློན་པོ་རྣམས་ཀྱིས་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཡོངས་སུ་མྱ་ངན་ལས་འདས་ཏེ་ཞག་བདུན་ལོན་ནས་བསྟན་པ་ནུབ་ལགས་སོ་ཞེས་གསོལ་ཏོ། །
en: “ ‘Now that seven days have passed since the totally and completely awakened Buddha has passed into parinirvāṇa, the doctrine has disappeared,’ the ministers replied.

source: རྒྱལ་པོས་བཀའ་སྩལ་པ། དེའི་དགེ་སློང་གང་གིས། དེའི་བསྟན་པ་འཛིན་པར་འགྱུར་བ་དེ་ལྟ་བུ་གཅིག་ཀྱང་མེད་དམ་ཞེས་བྱས་ནས།
en: “ ‘Is there not a single monk who can act as keeper of the doctrine?’ the king asked.

source: རྒྱལ་པོ་ཀྲྀ་ཀཱིས་མཆོད་རྟེན་དེ་ལ་བཀུར་སྟི་བྱས་ཏེ་སོང་ངོ་། །
en: And with that, King Kṛkī venerated the stūpa and departed.

source: བློན་པོའི་བུ་དེས་ཀྱང་མཆོད་རྟེན་དེ་ལ་བཀུར་སྟི་བྱས་ནས་སྨོན་ལམ་བཏབ་པ།
en: “Thereupon the minister’s son also venerated the stūpa and prayed,

source: དགེ་བའི་རྩ་བ་འདིས་བདག་གང་དང་གང་དུ་སྐྱེ་བར་འགྱུར་བ་དེ་དང་དེར་ཕྱུག་ཅིང་ནོར་མང་ལ་ལོངས་སྤྱོད་ཆེ་བའི་རིགས་སུ་སྐྱེ་བར་གྱུར་ཅིག །
en: ‘By this root of virtue, wherever I am born, may it be into a family of great means, prosperity, and wealth.

source: གཞན་ཡང་བདག་གིས་དེ་ཡོངས་སུ་མྱ་ངན་ལས་འདས་ནས། བསྟན་པ་འཛིན་པར་གྱུར་ཅིག་ཅེས་བྱས་སོ། །
en: After his parinirvāṇa may I also become a keeper of the doctrine.’

source: དེའི་ཚེ་བློན་པོའི་བུ་གང་ཡིན་པ་དེ་ནི་དགེ་སློང་འོད་སྲུང་འདི་ཁོ་ན་ཡིན་ཏེ།
en: The one who was the minister’s son then is none other than the monk Kāśyapa .

source: འདིས་དེར་སྨོན་ལམ་བཏབ་བོ།། །།
en: It was at that time that he made this prayer.”

source: འཛིན་བྱེད་ཀྱི་བུ་ཞེས་བྱ་བ་ནི།
en: The Story of Son of Grasping

source: གླེང་གཞི་རྒྱལ་པོའི་ཁབ་ན་བཞུགས་ཏེ། དེའི་ཚེ་རྒྱལ་པོའི་ཁབ་ན་བྲམ་ཟེ་ཆེ་ཞིང་མཐོ་བ་འཛིན་བྱེད་ཅེས་བྱ་བ་ཞིག་གནས་སོ། །
en: When the Blessed One was in Rājagṛha, there lived certain great brahmin named Grasping .

source: འདམ་བུ་སྦྱིན་ཞེས་བྱ་བའི་གྲོང་ན་ནི་བྲམ་ཟེ་རྒྱལ་ཞེས་བྱ་བ་ཞིག་གནས་ཏེ།
en: In the village of Nālada there lived another brahmin named Tiṣya.

source: དེ་གཉིས་མཛའ་ཞིང་བཤེས་ལ་གཅུགས་པར་གྱུར་ཏོ། །
en: The two were dear friends.

source: དེ་ནས་བྲམ་ཟེ་རྒྱལ་ཆུང་མ་དང་ལྷན་ཅིག་ཏུ་རྩེ་ཞིང་དགའ་ལ་དགའ་མགུར་སྤྱོད་པ་ལས། ཆུང་མ་ལ་བུ་ཆགས་ནས་
en: As the brahmin Tiṣya and his wife enjoyed themselves and coupled, one day his wife conceived.

source: དེའི་བཙས་སྟོན་རྒྱས་པར་བྱས་ནས། མིང་ཤཱ་རིའི་བུ་ཞེས་བྱ་བ་དང་ཉེ་རྒྱལ་ཞེས་བྱ་བར་བཏགས་སོ། །
en: At the elaborate feast celebrating his birth, they named him Śāriputra Upatiṣya.

source: དེ་ནས་ཕྱི་ཞིག་ན་བྲམ་ཟེ་འཛིན་བྱེད་ཀྱི་ཆུང་མ་ལ་ཡང་བུ་ཆགས་ནས། དེ་ཟླ་བ་དགུའམ་བཅུ་ལོན་པ་དང་ཁྱེའུ་གཟུགས་བཟང་ཞིང་བལྟ་ན་སྡུག་ལ་མཛེས་པ་ཞིག་བཙས་ཏེ།
en: Then one day the brahmin Grasping ’s wife conceived, and after nine or ten months had passed, she gave birth to a child who was well proportioned, pleasing to the eye, and beautiful.

source: ཁྱེའུ་འདི་བྲམ་ཟེ་ཆེ་ཞིང་མཐོ་བ་འཛིན་བྱེད་ཀྱི་བུ་ཡིན་པས་ན། ཁྱེའུ་འདིའི་མིང་འཛིན་བྱེད་ཀྱི་བུ་ཞེས་གདགས་སོ་ཞེས་ཟེར་རོ། །
en: And they named him, saying, “Since this is the great, high brahmin Grasping ’s child, his name will be Son of Grasping.”

source: དེ་ནས་ཁྱེའུ་འཛིན་བྱེད་ཀྱི་བུ་འོ་མ་དང་མར་དང་ཞོ་དང་ཞུན་མར་དང་མར་གྱི་ཉིང་གུས་བསྐྱེད་བསྲིངས་ནས།
en: They reared young Son of Grasping on milk, yogurt, butter, ghee, and milk solids.

source: གང་གི་ཚེ་དེ་གཉིས་ཆེར་སྐྱེས་པ་དེའི་ཚེ་དེ་གཉི་ག་བྱིས་པ་སློབ་པའི་གྲྭར་གཏད་ནས།
en: When the brahmins’ sons had grown, they were sent to school.

source: དེ་གཉི་ག་ཡང་ཡི་གེ་མཐར་ཕྱིན་པར་ལོབས་ཏེ། དེ་གཉི་གས་བསྟན་བཅོས་ཐམས་ཅད་ལོབས་སོ། །
en: Both perfected the study of letters and became educated in all the scriptures.

source: ཉེ་རྒྱལ་གྱིས་ནི་ལོ་བཅུ་དྲུག་ལོན་ནས་དབང་པོའི་བརྡ་སྤྲོད་པ་ཡང་ལོབས་ཏེ་གཞུང་གིས་རྒོལ་བ་ཐམས་ཅད་ཚར་གཅད་དོ། །
en: When Śāriputra Upatiṣya was sixteen years of age, being educated in the Aindra school of Sanskrit grammar, he used the scriptures to defeat all his opponents in debate.

source: དེ་ནས་ཕྱི་ཞིག་ན་དཀའ་ཐུབ་ཀྱི་ནགས་ཚལ་དུ་རྟེན་བཅས་ནས།
en: One day he went to live in a forest devoted to austerities.

source: དེ་ཀུན་དུ་རྒྱུ་དག་གི་ནང་དུ་རབ་ཏུ་བྱུང་ངོ་། །
en: He went forth and lived among the mendicant monks known as the parivrājaka.

source: དེར་གང་གི་ཚེ་སངས་རྒྱས་འཇིག་རྟེན་དུ་བྱུང་བ་དེའི་ཚེ་བྲམ་ཟེའི་བུ་ཤཱ་རིའི་བུ་དང་མཽད་གལ་གྱི་བུ་གཉིས་བཅོམ་ལྡན་འདས་ཀྱི་བསྟན་པ་ལ་རབ་ཏུ་བྱུང་ནས། དེར་དེ་གཉིས་ཀྱིས་ཉོན་མོངས་པ་ཐམས་ཅད་སྤངས་ཏེ་དགྲ་བཅོམ་པ་ཉིད་མངོན་སུམ་དུ་བྱས་ནས།
en: When the Buddha came to the world, the brahmins Śāriputra and Maudgalyāyana both went forth in the doctrine of the Blessed One, cast away all afflictive emotions, and manifested arhatship.

source: བཅོམ་ལྡན་འདས་ཀྱིས་དེ་གཉིས་ལས་གཅིག་ནི་ཤེས་རབ་ཆེ་བ་རྣམས་ཀྱི་མཆོག་ཏུ་བསྟན་ཏོ། །
en: The Blessed One commended the former as foremost among those of profound wisdom

source: གཅིག་ནི་རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ཏུ་བསྟན་ཏོ། །
en: and the latter as foremost among those with miraculous powers.

source: བྲམ་ཟེའི་ཁྱེའུ་འཛིན་བྱེད་ཀྱི་བུ་ནི་རྒྱལ་པོའི་ཞམ་རིང་བ་དཔའ་བོར་གྱུར་ཏེ།
en: The young brahmin Son of Grasping became a hero in the king’s court.

source: རྒྱལ་པོའི་ཕོ་བྲང་དེར་རྟག་ཏུ་འགྲོ་བ་ལས་དེ་ཤེས་རབ་དང་ལྡན་པའི་ཕྱིར། རྒྱལ་པོ་གཟུགས་ཅན་སྙིང་པོས་བློན་པོའི་མཆོག་ཏུ་བསྐོས་ནས། ལོངས་སྤྱོད་ཀྱི་གཞི་ཆེན་པོ་ཡང་བྱིན་ཏེ།
en: He constantly visited the royal palace, and because he was a wise person, King Bimbisāra appointed him chief minister and awarded him a great salary,

source: འཇིག་རྟེན་དག་ནི་འབྱོར་པ་འདོད་པ་ཡིན་ནོ། །
en: since worldly people wish for wealth.

source: དེ་ནས་ཕྱི་ཞིག་ན། དེས་ཀྱང་ཐབས་ཟླར་བབ་པ་ལས་ཆུང་མ་བླངས་ནས་དེ་དེ་དང་ལྷན་ཅིག་ཏུ་རྩེ་ཞིང་དགའ་ལ་དགའ་མགུར་སྤྱོད་ལ།
en: The time came for him to marry, so he took a wife and they enjoyed themselves and coupled.

source: དེས་ཁྱིམ་གྱི་འབྱོར་པ་རྒྱས་པར་བྱས་ཏེ་བཞག་གོ། །
en: He increased the wealth of their household and kept it all.

source: དེ་ནས་དེས་རྒྱལ་པོའི་ཁབ་དེར་རྒྱལ་པོ་ལ་བརྟེན་ཅིང་བྲམ་ཟེ་དང་ཁྱིམ་བདག་རྣམས་ཀྱི་ནོར་ལེན་པར་བྱེད་དོ། །
en: He accepted money from the brahmins and householders in Rājagṛha on behalf of the king,

source: བྲམ་ཟེ་དང་ཁྱིམ་བདག་རྣམས་ལ་བརྟེན་ཅིང་རྒྱལ་པོའི་ནོར་ལེན་པར་བྱེད་དོ། །
en: and he accepted money from the king on behalf of the brahmins and householders.

source: དེ་ནས་ཕྱི་ཞིག་ན། ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུས། འཛིན་བྱེད་ཀྱི་བུ་གདུལ་བའི་དུས་ལ་བབ་པར་མཐོང་ནས།
en: One day, Śāriputra saw the time had come to tame Son of Grasping.

source: སྔ་དྲོ་ཤམ་ཐབས་དང་ཆོས་གོས་བགོས་ཏེ་ལྷུང་བཟེད་ཐོགས་ནས་བྲམ་ཟེ་འཛིན་བྱེད་ཀྱི་བུའི་ཁྱིམ་ག་ལ་བ་དེར་སོང་ངོ་། །
en: In the morning he donned his lower garment and Dharma robes, and, carrying his alms bowl, he went to the place where Son of Grasping’s house stood.

source: དེའི་ཚེ་བྲམ་ཟེ་འཛིན་བྱེད་ཀྱི་བུ་ཤིང་མ་ལ་ལི་ཀའི་འདབ་ན་བ་འཇོ་བའི་ཞལ་ཏ་བྱེད་ཅིང་འདུག་པ་ལས།
en: At that time, the brahmin Son of Grasping was seated beneath a mālaka tree, carrying out his cow-milking duties.

source: བྲམ་ཟེ་འཛིན་བྱེད་ཀྱི་བུས་ཐག་རིང་པོ་ཞིག་ནས་ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུ་མཐོང་ངོ་། །
en: Son of Grasping saw Venerable Śāriputra in the distance

source: མཐོང་ནས་ཀྱང་ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུ་ག་ལ་བ་དེར་སོང་སྟེ་ཕྱིན་ནས།
en: and went to where Venerable Śāriputra stood.

source: ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུ་ལ་ཡན་ལག་ཐམས་ཅད་ཀྱིས་འཁྱུད་ནས་ཁྱིམ་གྱི་ནང་དུ་ཁྲིད་དེ། སྟན་བཤམས་པ་ལ་འདུག་ཏུ་བཅུག་སྟེ།
en: He embraced Venerable Śāriputra, led him to the house, and insisted he sit on the seat that he had now prepared for him.

source: ཀྱེ་ཤཱ་རིའི་བུ་བཤོས་གསོལ་ལ་འོ་མ་ཡང་གསོལ་ཅིག་ཅེས་བྱས་སོ། །
en: “Śāriputra, as you take your meal, please drink some milk as well.”

source: ཤཱ་རིའི་བུ་ན་རེ་འཛིན་བྱེད་ཀྱི་བུ་ང་ལ་སེམས་དགའ་བར་བྱས་ཟིན་གྱིས་དེས་ཆོག་གོ། །
en: “Just your happiness at seeing me is enough for me,” replied Śāriputra.

source: འཛིན་བྱེད་ཀྱི་བུས་སྨྲས་པ། ཀྱེ་ཤཱ་རིའི་བུ་ཁྱོད་ཡུན་རིང་མོ་ཞིག་ན་གདོད་བདག་གི་ཁྱིམ་དུ་ཕྱིན་ན། ཅིའི་ཕྱིར་ཟན་གཅིག་ཙམ་ཡང་ཟར་མི་བཏུབ།
en: “Śāriputra, you traveled such a long way to my house. Why is it you won’t take even a little food?” Son of Grasping asked.

source: ཤཱ་རིའི་བུས་སྨྲས་པ། འཛིན་བྱེད་ཀྱི་བུ་འདི་ལྟར་ཁྱོད་ནི་ངང་ཚུལ་འཆལ་ཅིང་ངང་ཚུལ་ཉམས་པ་ཡིན་ཏེ།
en: “Son of Grasping, I do this because you are becoming increasingly immoral,” replied Śāriputra.

source: རྒྱལ་པོ་ལ་བརྟེན་ཅིང་བྲམ་ཟེ་དང་ཁྱིམ་བདག་རྣམས་ཀྱི་ནོར་ལེན་པར་བྱེད་ལ།
en: “On behalf of the king you accept money from the brahmins and householders,

source: བྲམ་ཟེ་དང་ཁྱིམ་བདག་རྣམས་ལ་བརྟེན་ཅིང་རྒྱལ་པོའི་ནོར་ལེན་པར་བྱེད་པའི་ཕྱིར་རོ། །
en: and on behalf of the brahmins and householders you accept money from the king.”

source: འཛིན་བྱེད་ཀྱི་བུས་སྨྲས་པ། ཀྱེ་ཤཱ་རིའི་བུ་བདག་ནི་ཁྱིམ་པ་སྟེ།
en: “Śāriputra,” said Son of Grasping, “I am a layman.

source: ཁྱིམ་ན་གནས་པ་ལགས་པས་ན། བདག་གིས་ནི་བདག་ཉིད་དང་ཕ་མ་དང་བུ་དང་ཆུང་མ་དང་བྲན་དང་བྲན་མོ་དང་ལས་བྱེད་པ་དང་ཞོ་ཤས་འཚོ་བ་དང་མཛའ་བོ་དང་སྙིང་ཉེ་བ་དང་ཉེ་དུ་དང་རྒན་རབས་ཀྱང་ཡང་དག་པར་བདེ་བས་ཚིམ་པར་བྱ་དགོས་སོ། །
en: As a landowner I have to provide for myself, my parents, my children, my spouse, my servants both male and female, and the workers and others to whom I pay wages, as well as those near and dear to me and my aged relatives. I have to keep all of them happy and content.

source: རྒྱལ་པོ་ལ་ཡང་ས་གཞིའི་རག་ལུས་ལ།
en: I also have to rely on the king for land.

source: ལྷ་ཡང་རྗེད་དགོས། སྔོན་གྱི་མཚུན་དག་ཀྱང་གཏོར་དགོས། དགེ་སྦྱོང་དང་བྲམ་ཟེ་རྣམས་ཀྱང་ཟན་སྦྱིན་དགོས་ཏེ།
en: I have to propitiate the deities, put out offerings for the ancestors, and provide food for the ascetics and brahmins.

source: བདག་གིས་ནི་ཆོས་བཞིན་དུ་བྱེད་པ་འབའ་ཞིག་གིས་བདེ་བླག་ཏུ་འབྱོར་པར་མི་ནུས་སོ། །
en: If I do only as the law specifies, I am not able to easily acquire wealth.”

source: ཤཱ་རིའི་བུས་སྨྲས་པ། འཛིན་བྱེད་ཀྱི་བུ་འོ་ན་ཁྱོད་ཉིད་ལ་དྲི་བར་བྱས།
en: “Well then, Son of Grasping,” Śāriputra replied, “I have a question for you.

source: ཁྱོད་ཀྱིས་ཇི་ལྟར་བཟོད་པ་དེ་བཞིན་དུ་དེའི་ལན་ཐོབ་ཤིག །
en: Just answer as best you can.

source: དཔེར་ན་མི་ཞིག་གིས་ཕ་མ་གཉིས་ཀྱི་ཕྱིར་ཆོས་མ་ཡིན་པ་སྤྱོད་ཅིང་ལོག་པར་སྤྱོད་དེ།
en: “Take a certain person who practices unrighteousness and acts immorally for the sake of his parents.

source: དེ་ཆོས་མ་ཡིན་པ་སྤྱོད་ཅིང་ལོག་པར་སྤྱོད་པ་དེས་ལུས་དང་བྲལ་ཏེ། ཤི་བའི་འོག་ཏུ་ངན་སོང་ངན་འགྲོ་ལོག་པར་ལྟུང་བ་སེམས་ཅན་དམྱལ་བ་རྣམས་སུ་སྐྱེས་ནས།
en: When that person, who practiced unrighteousness and acted so immorally, separates from his body after death and falls to lower states, takes rebirth as a hell being,

source: དེ་སེམས་ཅན་དམྱལ་བའི་སྲུངས་མ་རྣམས་ཀྱིས་བཟུང་སྟེ།
en: and is seized by the guardians of hell

source: སྡུག་བསྔལ་དྲག་པ་དང་མི་བཟད་པ་དང་ཚ་བ་དང་ཡིད་དུ་མི་འོང་བའི་ཚོར་བ་མྱོང་དུ་བཅུག་ནས།
en: and made to undergo dreadful suffering and extreme, excruciating, unbearable agony—

source: དེ་ན་རེ་སེམས་ཅན་དམྱལ་བའི་སྲུངས་མ་དག་བདག་ལ་གནོད་པ་འདི་དང་འདི་ལྟ་བུ་དག་མ་བྱེད་ཅིག །
en: when that person says, ‘Please, guardians of hell, do not harm me in such-and-such ways!

source: བདག་གིས་ཕ་མའི་ཕྱིར་ཆོས་མ་ཡིན་པ་སྤྱད་ཅིང་ལོག་པར་སྤྱད་པས། བདག་ཆོས་མ་ཡིན་པ་སྤྱད་ཅིང་ལོག་པར་སྤྱད་པ་དེས།
en: It was for the sake of my parents, you see, that I practiced unrighteousness and acted so immorally,

source: ལུས་དང་བྲལ་ཏེ་ཤི་བའི་འོག་ཏུ་ངན་སོང་ངན་འགྲོ་ལོག་པར་ལྟུང་བ་སེམས་ཅན་དམྱལ་བ་རྣམས་སུ་སྐྱེས་པར་ཟད་དོ་ཞེས་ཟེར་ན།
en: and that upon separating from my body after death I fell to lower states and took rebirth among the hell beings’—

source: འཛིན་བྱེད་ཀྱི་བུ་དེ་ཇི་སྙམ་དུ་སེམས།
en: Son of Grasping, what do you think?

source: མི་དེ་སེམས་ཅན་དམྱལ་བའི་སྲུངས་མ་རྣམས་ལས་དོན་དེ་འགྲུབ་པར་འགྱུར་རམ།
en: Will that person get what he wants from the guardians of hell?”

source: འཛིན་བྱེད་ཀྱི་བུས་སྨྲས་པ། ཤཱ་རིའི་བུ་དེ་ནི་མི་འགྲུབ་བོ། །
en: “No, Śāriputra, he will not,” replied Son of Grasping.

source: ཤཱ་རིའི་བུས་སྨྲས་པ། འཛིན་བྱེད་ཀྱི་བུ་དད་པ་དང་ལྡན་པའི་རིགས་ཀྱི་བུས་ཆོས་དང་ལྡན་པ་དང་ལས་ཀྱི་ཡོན་ཏན་དག་གིས་ལོངས་སྤྱོད་རྣམས་བསྒྲུབས་ཏེཕ་མ་གཉིས་ལ་དུས་དུས་སུ་ཡང་དག་པར་རི་མོ་བྱེད་པ་དང་། ཡང་དག་པར་བསྙེན་བཀུར་བྱེད་པ་དང་། ཡང་དག་པའི་བདེ་བས་སྟེན་པར་བྱེད་དེ།
en: “Son of Grasping,” continued Śāriputra, “there are faithful, noble children who have attained material comfort on account of good karma and a devout life, and who are perfectly content in the service of their parents, going from time to time to offer their genuine respect and gracious assistance.

source: སྡིག་པའི་ལས་ཀྱང་ཅུང་ཟད་ཀྱང་མི་བྱེད་ལ། བསོད་ནམས་ཀྱི་ལམ་ཡང་དག་པར་བླངས་ཏེ།
en: They do not carry out even the smallest nonvirtuous action but embrace the meritorious path and abide by that.

source: འདུག་ན་དེ་ལ་ཕ་མ་ཡང་འདི་སྙམ་དུ་སེམས་ཏེ།
en: “Their parents think,

source: རིགས་ཀྱི་བུ་འདི་ནི་དད་པ་དང་ལྡན་ཞིང་སྒྲུབ་ཕོད་ལ་རིགས་པས་འཚོ་བ་ཡིན་ཏེ།
en: ‘This noble child is so faithful and capable, and thus able to suitably provide for us.

source: རིགས་ཀྱི་བུ་འདིས་ནི་ཆོས་དང་ལྡན་པ་དང་། ལས་ཀྱི་ཡོན་ཏན་དག་གིས་ལོངས་སྤྱོད་རྣམས་བསྒྲུབས་ནས།
en: This noble child has attained material comfort on account of good karma and a devout life,

source: དུས་དུས་སུ་བདག་ཅག་ལ་ཡང་ཡང་དག་པར་རི་མོ་བྱེད། ཡང་དག་པར་བསྙེན་བཀུར་བྱེད། ཡང་དག་པར་བདེ་བས་སྟེན་པར་བྱེད་དེ།
en: and is also perfectly content in our service, coming from time to time to offer genuine respect and gracious assistance.

source: སྡིག་པའི་ལས་ཀྱང་ཅུང་ཟད་ཀྱང་མི་བྱེད་ལ། བསོད་ནམས་ཀྱི་ལམ་ཡང་ཡང་དག་པར་བླངས་ཏེ་འདུག་གོ་སྙམ་མོ། །
en: This noble child carries out not even the smallest nonvirtuous action but has embraced the meritorious path and abides by that.’

source: རིགས་ཀྱི་བུ་ཕ་མ་ལ་སླར་སྙིང་བརྩེ་བར་བྱེད་པ་དེ་ནི། དགེ་བའི་ཆོས་རྣམས་འཕེལ་བ་འབའ་ཞིག་ཏུ་འགྱུར་བར་རེ་བར་བྱ་སྟེ། ཡོངས་སུ་འགྲིབ་པར་མི་འགྱུར་རོ། །
en: Such noble children who wholeheartedly love their parents in return should expect their virtuous deeds to only increase, and never wane.

source: འཛིན་བྱེད་ཀྱི་བུ། དཔེར་ན་མི་ཞིག་གིས་བུ་དང་ཆུང་མ་དང་བྲན་དང་བྲན་མོ་དང་ལས་བྱེད་པ་དང་ཞོ་ཤས་འཚོ་བ་རྣམས་དང་མཛའ་བོ་དང་སྙིང་ཉེ་བ་དང་ཉེ་དུ་དང་རྒན་རབས་རྣམས་དང་རྒྱལ་པོ་དང་ལྷ་རྣམས་དང་དགེ་སྦྱོང་དང་བྲམ་ཟེ་རྣམས་ཀྱི་ཕྱིར་ཆོས་མ་ཡིན་པ་སྤྱོད་ཅིང་ལོག་པར་སྤྱོད་དེདེ་ཆོས་མ་ཡིན་པ་སྤྱོད་ཅིང་ལོག་པར་སྤྱོད་པ་དེས།
en: “But, Son of Grasping, take a certain person who practices unrighteousness and acts immorally for the sake of his parents, children, spouse, servants both male and female, and the workers and others to whom he pays wages, as well as for those near and dear to him, his aged relatives, the king, the deities, the ascetics, and brahmins.

source: ལུས་དང་བྲལ་ཏེ་ཤི་བའི་འོག་ཏུ་ངན་སོང་ངན་འགྲོ་ལོག་པར་ལྟུང་བ་སེམས་ཅན་དམྱལ་བ་རྣམས་སུ་སྐྱེས་ནས།
en: “When that person, who practiced unrighteousness and acted so immorally, separates from his body after death and falls to lower states, takes rebirth as a hell being,

source: བདག་གིས་དགེ་སྦྱོང་དང་བྲམ་ཟེ་རྣམས་ཀྱི་ཕྱིར་ཆོས་མ་ཡིན་པ་སྤྱད་ཅིང་ལོག་པར་སྤྱད་པར་ཟད་དོ་ཞེས་ཟེར་ན།
en: It was for the sake of the ascetics and brahmins, you see, that I practiced unrighteousness and acted so immorally’—

source: འཛིན་བྱེད་ཀྱི་བུ་ཇི་སྙམ་དུ་སེམས།
en: O Son of Grasping, what do you think?

source: ཤཱ་རིའི་བུས་སྨྲས་པ། འཛིན་བྱེད་ཀྱི་བུ་དད་པ་དང་ལྡན་པའི་རིགས་ཀྱི་བུས་ཆོས་དང་ལྡན་པ་དང་། ལས་ཀྱི་ཡོན་ཏན་དག་གིས་ལོངས་སྤྱོད་རྣམས་བསྒྲུབས་ཏེ
en: Śāriputra continued, “Son of Grasping, there are faithful, noble children who have attained material comfort on account of good karma and a devout life,

source: དགེ་སྦྱོང་དང་བྲམ་ཟེ་རྣམས་ལ་ཟས་སྦྱིན་པར་བྱེད་དེ།
en: who provide food for the ascetics and brahmins,
